MCUdude/MegaCoreX/megaavr/boards.txt
808.menu.clock.external_12MHz=External 12 MHz
808.menu.clock.external_12MHz.upload.speed=115200
808.menu.clock.external_12MHz.bootloader.OSCCFG=0x01
808.menu.clock.external_12MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
808.menu.clock.external_12MHz.build.f_cpu=12000000L

808.menu.clock.external_8MHz=External 8 MHz
808.menu.clock.external_8MHz.upload.speed=115200
808.menu.clock.external_8MHz.bootloader.OSCCFG=0x01
808.menu.clock.external_8MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
808.menu.clock.external_8MHz.build.f_cpu=8000000L

808.menu.clock.external_4MHz=External 4 MHz
808.menu.clock.external_4MHz.upload.speed=115200
808.menu.clock.external_4MHz.bootloader.OSCCFG=0x01
808.menu.clock.external_4MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
808.menu.clock.external_4MHz.build.f_cpu=4000000L

808.menu.clock.external_1MHz=External 1 MHz
808.menu.clock.external_1MHz.upload.speed=115200
808.menu.clock.external_1MHz.bootloader.OSCCFG=0x01
808.menu.clock.external_1MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
808.menu.clock.external_1MHz.build.f_cpu=1000000L

# Bootloader
808.menu.bootloader.no_bootloader=No bootloader
808.menu.bootloader.no_bootloader.upload.maximum_size=8192
808.menu.bootloader.no_bootloader.upload.extra_params=
808.menu.bootloader.no_bootloader.build.text_section_start=.text=0x0
808.menu.bootloader.no_bootloader.bootloader.file=/empty/empty.hex
808.menu.bootloader.no_bootloader.bootloader.BOOTEND=0x00

808.menu.bootloader.uart0_default=Optiboot (UART0 default pins)
808.menu.bootloader.uart0_default.upload.maximum_size=7680
808.menu.bootloader.uart0_default.upload.protocol=arduino
808.menu.bootloader.uart0_default.upload.extra_params=
808.menu.bootloader.uart0_default.build.text_section_start=.text=0x200
808.menu.bootloader.uart0_default.bootloader.file=/optiboot/optiboot_mega0_UART0_DEF_115200_PA7.hex
808.menu.bootloader.uart0_default.bootloader.BOOTEND=0x02
808.menu.bootloader.uart0_default.bootloader.SYSCFG0=0xC9

808.menu.bootloader.uart0_alternative=Optiboot (UART0 alternative pins)
808.menu.bootloader.uart0_alternative.upload.maximum_size=7680
808.menu.bootloader.uart0_alternative.upload.protocol=arduino
808.menu.bootloader.uart0_alternative.upload.extra_params=
808.menu.bootloader.uart0_alternative.build.text_section_start=.text=0x200
808.menu.bootloader.uart0_alternative.bootloader.file=/optiboot/optiboot_mega0_UART0_ALT_115200_PA7.hex
808.menu.bootloader.uart0_alternative.bootloader.BOOTEND=0x02
808.menu.bootloader.uart0_alternative.bootloader.SYSCFG0=0xC9

808.menu.bootloader.uart1_default=Optiboot (UART1 default pins)
808.menu.bootloader.uart1_default.upload.maximum_size=7680
808.menu.bootloader.uart1_default.upload.protocol=arduino
808.menu.bootloader.uart1_default.upload.extra_params=
808.menu.bootloader.uart1_default.build.text_section_start=.text=0x200
808.menu.bootloader.uart1_default.bootloader.file=/optiboot/optiboot_mega0_UART1_DEF_115200_PA7.hex
808.menu.bootloader.uart1_default.bootloader.BOOTEND=0x02
808.menu.bootloader.uart1_default.bootloader.SYSCFG0=0xC9

808.menu.bootloader.uart1_alternative=Optiboot (UART1 alternative pins)
808.menu.bootloader.uart1_alternative.upload.maximum_size=7680
808.menu.bootloader.uart1_alternative.upload.protocol=arduino
808.menu.bootloader.uart1_alternative.upload.extra_params=
808.menu.bootloader.uart1_alternative.build.text_section_start=.text=0x200
808.menu.bootloader.uart1_alternative.bootloader.file=/optiboot/optiboot_mega0_UART1_ALT_115200_PA7.hex
808.menu.bootloader.uart1_alternative.bootloader.BOOTEND=0x02
808.menu.bootloader.uart1_alternative.bootloader.SYSCFG0=0xC9

808.menu.bootloader.uart2_default=Optiboot (UART2 default pins)
808.menu.bootloader.uart2_default.upload.maximum_size=7680
808.menu.bootloader.uart2_default.upload.protocol=arduino
808.menu.bootloader.uart2_default.upload.extra_params=
808.menu.bootloader.uart2_default.build.text_section_start=.text=0x200
808.menu.bootloader.uart2_default.bootloader.file=/optiboot/optiboot_mega0_UART2_DEF_115200_PA7.hex
808.menu.bootloader.uart2_default.bootloader.BOOTEND=0x02
808.menu.bootloader.uart2_default.bootloader.SYSCFG0=0xC9

808.menu.bootloader.uart2_alternative=Optiboot (UART2 alternative pins)
808.menu.bootloader.uart2_alternative.upload.maximum_size=7680
808.menu.bootloader.uart2_alternative.upload.protocol=arduino
808.menu.bootloader.uart2_alternative.upload.extra_params=
808.menu.bootloader.uart2_alternative.build.text_section_start=.text=0x200
808.menu.bootloader.uart2_alternative.bootloader.file=/optiboot/optiboot_mega0_UART2_ALT_115200_PA7.hex
808.menu.bootloader.uart2_alternative.bootloader.BOOTEND=0x02
808.menu.bootloader.uart2_alternative.bootloader.SYSCFG0=0xC9
